Revit 2027 API
Room.Unplace Method
 Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Unplace()
Public Sub Unplace
public:
void Unplace()
member Unplace : unit -> unit
Remarks
 Note that current room is changed to unplaced and all corresponding rooms which in other group instance are deleted when in group edit mode.
See Also
Reference
Room Class
Autodesk.Revit.DB.Architecture Namespace